        IDENTIFICATION DIVISION.
        PROGRAM-ID. Hello.
        AUTHOR. Deepak.
        INSTALLATION. Kirpa Bhawan.
        DATE-WRITTEN. 02-02-2007.
        DATE-COMPILED.
        SECURITY. General.
        ENVIRONMENT DIVISION.
        DATA DIVISION.
        PROCEDURE DIVISION.
        StartPara.
           DISPLAY (10, 10) "Hello World.".
           STOP RUN.
